et713-20260514-mdl-coffee-lcars-repo-main/lcars-coffee/app/views/suppliers/show.html.erb

    <dt>Phone</dt><dd><%= @supplier.phone %></dd>
    <dt>SKU Count</dt><dd><%= @supplier.beans.count %></dd>
    <dt>Total Stock</dt><dd><%= number_with_delimiter(@supplier.beans.sum(:quantity)) %> units</dd>
    <dt>Total Value</dt><dd><%= sprintf("%.2f", @supplier.beans.sum("price * quantity")) %> cr</dd>
---
SELECT "beans".* FROM "beans" WHERE "beans"."supplier_id" = 2
SELECT SUM(price * quantity) FROM "beans" WHERE "beans"."supplier_id" = 2
SELECT COUNT(*) FROM "beans" WHERE "beans"."supplier_id" = 2
SELECT SUM("beans"."quantity") FROM "beans" WHERE "beans"."supplier_id" = 2


<% if @supplier.beans.any? %>
---
SELECT 1 AS one FROM "beans" WHERE "beans"."supplier_id" = 2 LIMIT 1

    <div class="panel-label" style="margin-bottom: 12px;">// Supplied Beans</div>
    <% max_qty = @supplier.beans.maximum(:quantity) || 1 %>
    <div class="bean-list">
      <% @supplier.beans.each do |bean| %>
---
SELECT MAX("beans"."quantity") FROM "beans" WHERE "beans"."supplier_id" = 2
SELECT "beans".* FROM "beans" WHERE "beans"."supplier_id" = 2