app/controllers/beans_controller.rb

SELECT "beans".* FROM "beans"
---
  def index
    @beans = Bean.all

INSERT INTO "beans" ("supplier_id", "bean_type", "product_name", "price", "description", "quantity", "created_at", "updated_at") VALUES (1, 'Arabica', 'McCafe', 1.0, 'Fabulous', 1, '2026-05-14 22:40:58.273133', '2026-05-14 22:40:58.273133') RETURNING "id"
---
  def create
    @bean = Bean.new(bean_params)

    respond_to do |format|
      if @bean.save

SELECT "beans".* FROM "beans" WHERE "beans"."id" = 2 LIMIT 1
---
    def set_bean
      @bean = Bean.find(params.expect(:id))