et713-20260514-mdl-coffee-lcars-repo-main/lcars-coffee/app/views/beans/_form.html.erb

SELECT "suppliers".* FROM "suppliers" ORDER BY "suppliers"."name" ASC
---
    <%= form.label :supplier_id, "Supplier" %>
    <%= form.collection_select :supplier_id, Supplier.order(:name), :id, :name, include_blank: "— unassigned —" %>