app/views/suppliers/index.html.erb

    <% @suppliers.each do |supplier| %>
      <% sku_count = supplier.beans.count %>
      <% total_stock = supplier.beans.sum(:quantity) %>
      <% total_value = supplier.beans.sum("price * quantity") %>
---
SELECT SUM(price * quantity) FROM "beans" WHERE "beans"."supplier_id" = 1
SELECT COUNT(*) FROM "beans" WHERE "beans"."supplier_id" = 1
SELECT SUM("beans"."quantity") FROM "beans" WHERE "beans"."supplier_id" = 1